import type { Char } from "../types"

export default <Char[]> [
  { chr: "̃", map: "01000010" },
  { chr: "̄", map: "10000000" },
  { chr: "̀", map: "00000100" },
  { chr: "`", map: "00000100" },
  { chr: "́", map: "01000000" },
  { chr: "´", map: "01000000" },
  { chr: "¨", map: "01000100" },
  { chr: "̂", map: "11000100" },
  { chr: "̊", map: "11000110" },
  { chr: "̧", map: "01000010" },
  { chr: "̆", map: "01000110" },
  { chr: "̨", map: "00000110" },
  { chr: "̇", map: "01000000" },
  { chr: "̌", map: "01000110" },
  { chr: "̋", map: "01000010" },
  { chr: "̛", map: "01000010" },
  { chr: "̏", map: "00000110" },
  { chr: "̑", map: "11000100" },
  { chr: "̦", map: "00000100" },

  { chr: "̈", var: { _: "\u0300\u0301" } },
]
