import type { Char } from "../types"

export default <Char[]> [
  { chr: "̃", pin: "01000010" },
  { chr: "̄", pin: "10000000" },
  { chr: "̀", pin: "00000100" },
  { chr: "`", pin: "00000100" },
  { chr: "́", pin: "01000000" },
  { chr: "´", pin: "01000000" },
  { chr: "¨", pin: "01000100" },
  { chr: "̂", pin: "11000100" },
  { chr: "̊", pin: "11000110" },
  { chr: "̧", pin: "01000010" },
  { chr: "̆", pin: "01000110" },
  { chr: "̨", pin: "00000110" },
  { chr: "̇", pin: "01000000" },
  { chr: "̌", pin: "01000110" },
  { chr: "̋", pin: "01000010" },
  { chr: "̛", pin: "01000010" },
  { chr: "̏", pin: "00000110" },
  { chr: "̑", pin: "11000100" },
  { chr: "̦", pin: "00000100" },

  { chr: "̈", var: { _: "\u0300\u0301" } },
]
